CSI API ETABS v1

# cSapModelLoadPatterns Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cLoadPatterns LoadPatterns { get; }

    ReadOnly Property LoadPatterns As cLoadPatterns
    	Get

    Dim instance As cSapModel
    Dim value As cLoadPatterns

    value = instance.LoadPatterns

    property cLoadPatterns^ LoadPatterns {
    	cLoadPatterns^ get ();
    }

    abstract LoadPatterns : cLoadPatterns with get

#### Property Value

Type: cLoadPatterns

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com